# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

import random

ar = [random.randint(-10, 10) for _ in range(5)]

n_ar = [i**2 for i in ar]
print(ar, '=>', n_ar)


# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

fr_lst1 = ['яблоко', 'апельсин', 'банан', 'киви']
fr_lst2 = ['киви', 'груша', 'ананас', 'яблоко']
print(fr_lst1)
print(fr_lst2)
n_lst = [i for i  in fr_lst1 for j in fr_lst2 if i == j]
print(n_lst)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

arr = [random.randint(-30, 30) for _ in range(15)]
print(arr)
arr1 = [i for i in arr if i % 3 == 0 and i > 0 and i % 4 > 0]
print(arr1)
