# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.


arr = ["яблоко", "банан", "киви", "арбуз"]
c = 0
for i in arr:
	c += 1
	print(c, '{:>8}'.format(i))

# Подсказка: воспользоваться методом .format()


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.
arr1 = [2, 2, 1, 1, 4, 1, 8, 3] 
arr2 = [1, 4, 8]

dif = list(set(arr1) ^ set(arr2))
arr1 = [i for i in arr1 if i in dif ]



print(arr1)
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

n_arr = [1, 2, 3, 4, 5, 6, 7, 8]
m_arr = []
for i in n_arr:
	if i % 2 == 0:
		m_arr.append(i/4)
	else:
		m_arr.append(i*2)

print(m_arr)
