# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано:
import math
arr = [2, -5, 8, 9, -25, 25, 4]
n_arr = []


for i in arr:
	if i > 0 and (math.sqrt(i) - int(math.sqrt(i))==0):
		n_arr.append(i)
print(n_arr)
# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

mn = {'01': 'январь', '02': 'февраль', '03': 'март', '04': 'апрель', '05': 'май', '06': 'июнь', '07': 'июль', '08': 'август', '09': 'сентябрь', '10': 'октябрь', '11': 'ноябрь', '12': 'декабрь'}
day = {'1': "первое", '2': "второе", '3': "третье", '4': "четвертое", '5': "пятое", '6': "шестое", '7': "седьмое", '8': "восьмое", '9': "девятое", '10': "десятое", '11': "одинадцатое", '12': "двенадцатое", '13': "тринандцатое", '14': "четырнадцатое", '15': "пятнадцатое", '16': "шестнадцатое", '17': "семнадцатое", '18': "восемнадцатое", '19': "девятнадцатое", '20': "двадцатое", '21': 'двадцать первое', '22': "двадцать второе", '23': "двадцать третье", '24': "двадцать четвертое", '25': "двадцать пятое", '26': "двадцать шестое", '27': "двадцать седбмое", '28': "двадцать восьмое", '29': "двадцать девятое", '30': "тридцатое", '31': "тридцать первое"}

data = input('Введите дату дд.мм.гггг: ')
i = data.split('.')
print(i)
print('{} {} {}'.format(day[i[0]], mn[i[1]], i[2])) 




# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random
n = int(input('Введи число n: '))

rand_arr = []
i = 0
while i != n:
	rand_arr.append(random.randint(-100, 100))
	i += 1

print(rand_arr)
# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
lst = [1, 2, 4, 5, 6, 2, 5, 2]

lst2 = list(set(lst))

print(lst2)

# б) элементы исходного списка, которые не имеют повторений:
# например, 
lst1 = [1 , 2, 4, 5, 6, 2, 5, 2] #нужно получить lst2 = [1, 4, 6]

lst3 = [i for i in lst1 if lst1.count(i) <2]

print(lst3)


