# Задание-1:
# Реализуйте описаную ниже задачу, используя парадигмы ООП:
# В школе есть Классы(5А, 7Б и т.д.), в которых учатся Ученики.
# У каждого ученика есть два Родителя(мама и папа).
# Также в школе преподают Учителя. Один учитель может преподавать 
# в неограниченном кол-ве классов свой определенный предмет. 
# Т.е. Учитель Иванов может преподавать математику у 5А и 6Б,
# но больше математику не может преподавать никто другой.

# Выбранная и заполненная данными структура должна решать следующие задачи:
# 1. Получить полный список всех классов школы
# 2. Получить список всех учеников в указанном классе
#  (каждый ученик отображается в формате "Фамилия И.О.")
# 3. Получить список всех предметов указанного ученика 
#  (Ученик --> Класс --> Учителя --> Предметы)
# 4. Узнать ФИО родителей указанного ученика
# 5. Получить список всех Учителей, преподающих в указанном классе

class People:
	def __init__(self, Name):
		self.Name = Name
		
	def full_name(self):
		sname = self.Name.split(' ')		
		return sname[0] + ' ' + sname[1][0] + '.' + sname[2][0] + '.'		


class Teacher(People):
	def __init__(self, Name, Subject):
		super().__init__(Name)
		self.Subject = Subject
		self.teachers_sub = {self.Name: self.Subject}

		

class Students(People):
	def __init__(self, Name, mother, father, ClassN):
		super().__init__(Name)
		self.mother = mother
		self.father = father
		self.ClassN = ClassN
		
class classes():
	def __init__(self, ClassN, *Name):
		self.Name = Name		
		self.ClassN = ClassN


stud = [Students('Прогулялов Иван Сидорович', 'Прогулялова Елена Анатольевна', 'Прогуляллов Сидор Иванович', '5А'), 
	Students('Заболелов Дмитрий Иванович', 'Заболелова Марина Васильевна', 'Заболелов Иван Иванович', '5А'),
	Students('Смирнов Олег Петрович', 'Смирнова Ольга Ивановна', 'Смирнов Петр Иванович', '5А'), 
	Students('Коропетян Коропет Айкович', 'Коропитян Анна Армановна', 'Коропетян Айк Аванасевич', '5А'),
	Students('Семенов Семен Семенович', 'Семенова Изабелла Астаховна', 'Семенов Семен Семенович', '5А'), 
	Students('Хорошева Ирина Петровна', 'Хорошева Марина Витальевна', 'Хорошев Петр Васильевич', '5Б'),
	Students('Забугоркин Идрис Маратович', 'Забугоркина Мария Павловна', 'Забугоркин Марат Уралович', '5Б'), 
	Students('Пупкина Луиза Викторовна', 'Иванова Мария Викторовна', 'Пупкин Виктор Игнатович', '5Б'),
	Students('Неуспевакин Семен Олегович', 'Неуспевакина Елена Птровна', 'Неуспевакин Олег Анатольевич', '5Б'), 
	Students('Отличная Наталья Егоровна', 'Отличная Ирина Михайловна', 'Отличный Егор Дмитриевич', '5Б'),
	Students('Списайло Никита Дмитриевич', 'Списайло Наталья Сергеевна', 'Списайло Дмитрий Павлович', '6А'), 
	Students('Сонная Елена Васильевна', 'Сонная Елена Кирилловна', 'Сонный Василий Васильевич', '6А'),
	Students('Кудрявцев Петр Петрович', 'Кудрявцева Кристина Валерьевна', 'Кудрявцев Петр Викторович', '6А'), 
	Students('Плахин Дмитрий Олегович', 'Плахина Мария Климовна', 'Плахин Олег Иванович', '6А'),
	Students('Жуков Клим Александрович', 'Жукова Ирина Степановна', 'Жуков Александер Юрьевич', '6А'), 
	Students('Переноскина Ольга Подносовна', 'Переноскина Мария Петровна', 'Переноскин Поднос Вилков', '6Б'),
	Students('Иванов Иван Архипович', 'Иванова Мария Ивановна', 'Иванов Дмитрий Степенович', '6Б'), 
	Students('Пучков Дмитрий Юрьевич', 'Пучкова Ольга Петровна', 'Пучков Юрий Васильевич', '6Б'),
	Students('Цой Виктор Робертович', 'Цой Анита Викторовна', 'Цой Роберт Андреевич', '6Б'), 
	Students('Бритва Борис Борисович', 'Бритва Полина Олеговна', 'Бритва Борис Андреевич', '6Б'),
	Students('Пушкина Анна Сергеевна', 'Пушкина Ольга Олеговна', 'Пушкин СергейАлександрович', '7А'), 
	Students('Болконский Андрей Генрихович', 'Болконская Лиза Петровна', 'Болконский Генрих Петрович', '7А'),
	Students('Первый Петр Алексеевич', 'Первая Екатерина Глазырина', 'Первый Алексей Иванович', '7А'), 
	Students('Каренина Анна Локомотивовна', 'Каренина Анна Рельсовна', 'Каренин Локомотив Уголевич', '7А'),
	Students('Ибн Сина Хасанович', 'Ибн Фатима Мустафовна', 'Ибн Хасан Хусейнович', '7А'), 
	Students('R2 D2 Ханович', 'R2 Патме Вейдоровна', 'Чубакин ХАН Соколович', '7Б'),
	Students('Беггинс Фродо Бильбович', 'Беггинс Ирина Каплановна', 'Беггинс Бильбо Сауронович', '7Б'), 
	Students('Водяная Русалка Пасейдоновна', 'Водяная Ариэль Трезубовна', 'Водяной Пасейдон Планктонович', '7Б'),
	Students('Красивая Афродита Марсовна', 'Красивая Винера Вавилововна', 'Красивый Нарцис Велнсович', '7Б'), 
	Students('Жуткий Тип Федорович', 'Жуткая Жизнь Иммануиловна', 'Жуткий Федор Михайлович', '7Б')]


teach = [Teacher('Ньютонова Елена Михайловна', 'Физика'), 
	 Teacher('Водородова Маргарита Васильевна', 'Химия'),
	 Teacher('Сокол Ирина Павловна', 'Биология'), 
	 Teacher('Несторова Ирина Владимировна', 'История'),
	 Teacher('Интегралова Антонина Петровна', 'Математика'), 
	 Teacher('Кирилломефодьевна Светлана Анатольевна', 'Литература'), 
	 Teacher('Молотков Михаил Михайлович', 'Труды')]


clas_sb = [classes('5', teach[3], teach[4], teach[5]),
	   classes('6', teach[3], teach[4], teach[5], teach[6], teach[0]),
	   classes('7', teach[3], teach[4], teach[5], teach[6], teach[0], teach[1], teach[2])]

print(' Выберите действие: \n 1. Получить полный список всех классов школы \n 2. Получить список всех учеников в указанном классе \n 3. Получить список всех предметов указанного ученика \n 4. Узнать ФИО родителей указанного ученика\n 5. Получить список всех Учителей, преподающих в указанном классе')
try:
	operation = '!'
	while operation != 0:
		operation = int(input('Введите номер орации: '))
		if operation == 1:	
			clas_list = []
			i = 0
			while i < len(stud): 
				clas_list.append(stud[i].ClassN)
				i += 1
			print(set(clas_list))
		elif operation == 2:
			cls = input('Введите номер класса: ')
			print('Список учащихся в данном классе:')			
			for line in stud:
				if line.ClassN == cls:
					 print(line.full_name())
		elif operation == 3:
			name = input('Укажите ФИО ученика: ')
			for line in stud:
				if name == line.Name:
					print('{}, учащийся {} класаа \nИзучает предметы: '.format(name, line.ClassN))
					for tch in clas_sb:
						if tch.ClassN == line.ClassN[0]:
							for nameClas in tch.Name:
								for nameTeach in teach:
									if nameClas.Name == nameTeach.Name:
										print(nameTeach.teachers_sub[nameTeach.Name])
										#print(nameTeach.teachers_sub) c учителями 
		elif operation == 4:
			name = input('Укажите ФИО ученика: ')
			for line in stud:
				if name == line.Name:
					print('Мама: ', line.mother, 'Папа: ', line.father)
		elif operation == 5:
			clas = input('Укажите класс, что бы получить список учителей: ')
			print('Учительский состав класса {}'.format(clas))
			for line in clas_sb:
				if clas[0] == line.ClassN:
					for i in line.Name:
						print(i.Name)	
		elif operation == 0:
			break
		else:
			print('Неверная команда')
except ValueError:
	print('Неверная команда')
